In [ ]:
# 1.ESTABLISHMENT OF CONNECTION BETWEEN MYSQL AND PYTHON.
# 2.SQL QUERIS : SHOW DATABASES, CREATE DATABASES,CREATE TABLE,INSERT DATA INTO TABLE,SELECT
# 3.COMMANDS LEARNT : EXECUTE,FETCH,COMMIT,TABULATE COMMAND TO REPRESENT DATA OUTPUT *all columns, respresent data of few columns

In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\admin\anaconda3\lib\site-packages (8.3.0)
Note: you may need to restart the kernel to use updated packages.

In [7]:
import mysql.connector as c
from tabulate import tabulate

In [8]:
mydb = c.connect(host =  'localhost', user = 'root', passwd = 'Loveumom@123')

In [10]:
cursor = mydb.cursor()

In [11]:
cursor.execute("show databases") # showing all the databases present in mysql
cursor.fetchall()

[('cardataset',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sidfirst',),
 ('sqlpractice1',),
 ('sys',)]

In [ ]:
cursor.execute("create database SQLPractice1") # DATABASE CREATED WITH NAME SQLPractice1

In [ ]:
cursor.execute
("""
CREATE TABLE SQLPractice1.student(
student_id INT AUTO_INCREMENT PRIMARY KEY,
first_name VARCHAR(50),
last_name VARCHAR(50),
birth_date DATE,
gender ENUM('M', 'F'),
major VARCHAR(100),
gpa DECIMAL(3, 2),
email VARCHAR(100),
phone_number VARCHAR(20))
""")                              # created table student in database sqlpractice1

In [19]:
cursor.execute
("""
INSERT INTO SQLPractice1.student (first_name, last_name, birth_date, gender, major, gpa, email, phone_number) VALUES
('John', 'Doe', '2001-05-15', 'M', 'Computer Science', 3.5, 'john.doe@example.com', '555-1234'),
('Jane', 'Smith', '2000-11-22', 'F', 'Mathematics', 3.8, 'jane.smith@example.com', '555-5678'),
('Mike', 'Brown', '2002-03-03', 'M', 'Physics', 3.2, 'mike.brown@example.com', '555-8765'),
('Emma', 'Davis', '1999-12-15', 'F', 'Biology', 3.7, 'emma.davis@example.com', '555-4321'),
('Chris', 'Johnson', '2001-08-09', 'M', 'Chemistry', 3.1, 'chris.johnson@example.com', '555-6789'),
('Olivia', 'Wilson', '2002-02-25', 'F', 'English', 3.9, 'olivia.wilson@example.com', '555-2345'),
('James', 'Taylor', '2000-07-30', 'M', 'History', 3.4, 'james.taylor@example.com', '555-3456'),
('Sophia', 'Thomas', '2001-04-12', 'F', 'Economics', 3.6, 'sophia.thomas@example.com', '555-4567'),
('Liam', 'Anderson', '2002-10-05', 'M', 'Engineering', 3.3, 'liam.anderson@example.com', '555-5679'),
('Ava', 'Martinez', '1999-09-18', 'F', 'Psychology', 3.8, 'ava.martinez@example.com', '555-6780'),
('Ethan', 'Jackson', '2001-01-23', 'M', 'Philosophy', 3.0, 'ethan.jackson@example.com', '555-7891'),
('Isabella', 'White', '2002-06-14', 'F', 'Sociology', 3.7, 'isabella.white@example.com', '555-8902'),
('Alexander', 'Harris', '2000-10-27', 'M', 'Political Science', 3.5, 'alexander.harris@example.com', '555-9012'),
('Mia', 'Martin', '2001-12-05', 'F', 'Art', 3.9, 'mia.martin@example.com', '555-0123'),
('Noah', 'Thompson', '2002-04-18', 'M', 'Music', 3.2, 'noah.thompson@example.com', '555-1235'),
('Emily', 'Garcia', '1999-11-11', 'F', 'Theater', 3.8, 'emily.garcia@example.com', '555-2346'),
('Lucas', 'Martinez', '2001-09-21', 'M', 'Geology', 3.4, 'lucas.martinez@example.com', '555-3457'),
('Amelia', 'Rodriguez', '2002-03-30', 'F', 'Linguistics', 3.6, 'amelia.rodriguez@example.com', '555-4568'),
('Daniel', 'Lewis', '2000-05-07', 'M', 'Environmental Science', 3.1, 'daniel.lewis@example.com', '555-5670'),
('Grace', 'Lee', '2001-08-13', 'F', 'Anthropology', 3.7, 'grace.lee@example.com', '555-6781')
""")              # INSERT DATA INTO TABLE STUDENT

In [20]:
mydb.commit()

In [12]:
cursor.execute('select * from SQLpractice1.student')

In [13]:
"""
The command columns = [column[0] for column in cursor.description] is a Python list comprehension 
that extracts the column names from the cursor's description attribute. 
Here's a detailed breakdown of what this command does:

Breakdown of the Command
cursor.description: This attribute of the cursor object provides metadata 
about the columns of the result set returned by executing a query. 
It is a sequence of 7-item tuples, where each tuple contains information about one column. 
The first item (column[0]) in each tuple is the column name.

List Comprehension: [column[0] for column in cursor.description] is a list comprehension 
that iterates over each tuple in cursor.description and extracts the first item of each tuple (which is the column name).
columns = [column[0] for column in cursor.description] retrieves the column names from the cursor description.

# below instead of columns we can manually # columns = ["ID", "First Name", "Last Name", "Date of Birth", "Gender", "Major", "GPA", "Email", "Phone"]
"""
results = cursor.fetchall()
columns = [column[0] for column in cursor.description] 
print(tabulate(results, headers=columns, tablefmt='pretty'))

+------------+------------+-----------+------------+--------+-----------------------+------+------------------------------+--------------+
| student_id | first_name | last_name | birth_date | gender |         major         | gpa  |            email             | phone_number |
+------------+------------+-----------+------------+--------+-----------------------+------+------------------------------+--------------+
|     1      |    John    |    Doe    | 2001-05-15 |   M    |         Music         | 3.50 |     john.doe@example.com     |   555-1234   |
|     2      |    Jane    |   Smith   | 2000-11-22 |   F    |      Mathematics      | 3.80 |    jane.smith@example.com    |   555-5678   |
|     3      |    Mike    |   Brown   | 2002-03-03 |   M    |        Physics        | 3.20 |    mike.brown@example.com    |   555-8765   |
|     4      |    Emma    |   Davis   | 1999-12-15 |   F    |        Biology        | 3.70 |    emma.davis@example.com    |   555-4321   |
|     5      |   Chris    |  Johnson  | 2001-08-09 |   M    |       Chemistry       | 3.10 |  chris.johnson@example.com   |   555-6789   |
|     6      |   Olivia   |  Wilson   | 2002-02-25 |   F    |        English        | 3.90 |  olivia.wilson@example.com   |   555-2345   |
|     7      |   James    |  Taylor   | 2000-07-30 |   M    |        History        | 3.40 |   james.taylor@example.com   |   555-3456   |
|     8      |   Sophia   |  Thomas   | 2001-04-12 |   F    |       Economics       | 3.60 |  sophia.thomas@example.com   |   555-4567   |
|     9      |    Liam    | Anderson  | 2002-10-05 |   M    |      Engineering      | 3.30 |  liam.anderson@example.com   |   555-5679   |
|     10     |    Ava     | Martinez  | 1999-09-18 |   F    |      Psychology       | 3.80 |   ava.martinez@example.com   |   555-6780   |
|     11     |   Ethan    |  Jackson  | 2001-01-23 |   M    |      Philosophy       | 3.00 |  ethan.jackson@example.com   |   555-7891   |
|     12     |  Isabella  |   White   | 2002-06-14 |   F    |       Sociology       | 3.70 |  isabella.white@example.com  |   555-8902   |
|     13     | Alexander  |  Harris   | 2000-10-27 |   M    |   Political Science   | 3.50 | alexander.harris@example.com |   555-9012   |
|     14     |    Mia     |  Martin   | 2001-12-05 |   F    |          Art          | 3.90 |    mia.martin@example.com    |   555-0123   |
|     15     |    Noah    | Thompson  | 2002-04-18 |   M    |         Music         | 3.20 |  noah.thompson@example.com   |   555-1235   |
|     16     |   Emily    |  Garcia   | 1999-11-11 |   F    |        Theater        | 3.80 |   emily.garcia@example.com   |   555-2346   |
|     17     |   Lucas    | Martinez  | 2001-09-21 |   M    |        Geology        | 3.40 |  lucas.martinez@example.com  |   555-3457   |
|     18     |   Amelia   | Rodriguez | 2002-03-30 |   F    |      Linguistics      | 3.60 | amelia.rodriguez@example.com |   555-4568   |
|     19     |   Daniel   |   Lewis   | 2000-05-07 |   M    | Environmental Science | 3.10 |   daniel.lewis@example.com   |   555-5670   |
|     20     |   Grace    |    Lee    | 2001-08-13 |   F    |     Anthropology      | 3.70 |    grace.lee@example.com     |   555-6781   |
+------------+------------+-----------+------------+--------+-----------------------+------+------------------------------+--------------+

In [15]:
# WHERE clause

In [25]:
# task : run a query using where clause to check--> what is the major of lucas?

cursor.execute("SELECT major FROM SQLPractice1.student WHERE first_name = 'Lucas'")
results = cursor.fetchall()
columns = [column[0] for column in cursor.description] 
print(tabulate(results, headers=columns, tablefmt='pretty'))

+---------+
|  major  |
+---------+
| Geology |
+---------+

In [24]:
# UPDATE data
# used to update data that is already loaded in the table
# task is to update john doe 's major from Music to computer science

cursor.execute("UPDATE SQLPractice1.student SET major = 'Computer Science' WHERE first_name = 'john'")
mydb.commit()

In [25]:
cursor.execute('select first_name,major from SQLPractice1.student') # here we selected only 2 colums to see changes we made using update

In [26]:
rows = cursor.fetchall()
#columns = [column[0] for column in cursor.description]
print(tabulate(rows,headers=['first_name','major'],tablefmt='pretty')) # in headers we need to specify column names

+------------+-----------------------+
| first_name |         major         |
+------------+-----------------------+
|    John    |   Computer Science    |
|    Jane    |      Mathematics      |
|    Mike    |        Physics        |
|    Emma    |        Biology        |
|   Chris    |       Chemistry       |
|   Olivia   |        English        |
|   James    |        History        |
|   Sophia   |       Economics       |
|    Liam    |      Engineering      |
|    Ava     |      Psychology       |
|   Ethan    |      Philosophy       |
|  Isabella  |       Sociology       |
| Alexander  |   Political Science   |
|    Mia     |          Art          |
|    Noah    |         Music         |
|   Emily    |        Theater        |
|   Lucas    |        Geology        |
|   Amelia   |      Linguistics      |
|   Daniel   | Environmental Science |
|   Grace    |     Anthropology      |
+------------+-----------------------+